[
  {
    "title": "Barbara Windsor's Widower Defends Romance with Her EastEnders Co-Star",
    "summary": "Scott Mitchell, widower of Dame Barbara Windsor, discusses his new relationship with Tanya Franks and their shared dedication to dementia awareness.",
    "imageUrl": "",
    "link": "https://www.thesun.ie/tv/15225853/barbara-windsors-widower-defends-romance-eastenders-tanya-franks/"
  },
  {
    "title": "Raymond and Cynthia's Vow – 'Facing Things Together'",
    "summary": "Married for 55 years, Raymond and Cynthia James share how their enduring relationship helps them navigate his dementia diagnosis.",
    "imageUrl": "",
    "link": "https://www.dementiaresearcher.nihr.ac.uk/category/insipring-stories/"
  },
  {
    "title": "One Alzheimer's Caregiver's Story",
    "summary": "A caregiver reflects on the emotional journey of caring for loved ones with Alzheimer's, highlighting the challenges and rewards.",
    "imageUrl": "",
    "link": "https://www.iamacarewarrior.org/post/one-alzheimer-s-caregiver-s-story"
  },
  {
    "title": "Priceless Care: Alexis's Inspiring Story of Caregiving",
    "summary": "Alexis finds purpose and fulfillment in providing compassionate care to individuals with Alzheimer's and dementia.",
    "imageUrl": "",
    "link": "https://careindeed.com/blogs/employee-of-the-month-alexis"
  },
  {
    "title": "Debbie's Story: 'Not Enough People Are Aware of Early Onset Dementia'",
    "summary": "At 50, Debbie was diagnosed with mixed dementia. She shares her experiences to raise awareness about early onset dementia.",
    "imageUrl": "",
    "link": "https://www.alzheimers.org.uk/blog/debbies-early-onset-dementia-story"
  },
  {
    "title": "A Family's Dementia Journey: Meriam and Ruth's Caregiving Story",
    "summary": "Meriam shares her heartfelt experience of caring for her mother Ruth, emphasizing the importance of family support.",
    "imageUrl": "",
    "link": "https://careforth.com/blog/family-dementia-journey-meriam-and-ruth/"
  },
  {
    "title": "Laury's Story: 'Mum Became Utterly Lost in the Fog of Her Own Mind'",
    "summary": "Laury recounts her mother's battle with early-onset Alzheimer's, detailing the emotional toll on their family.",
    "imageUrl": "",
    "link": "https://www.alzheimers.org.uk/blog/laurys-mum-became-lost-in-fog-her-own-mind"
  },
  {
    "title": "Inspirational Personal Stories for Caregivers from Caregivers",
    "summary": "A collection of personal stories from caregivers sharing their experiences and insights in caring for loved ones with dementia.",
    "imageUrl": "",
    "link": "https://www.accessiblehomehealthcare.com/blog/inspirational-personal-stories-caregivers"
  },
  {
    "title": "Sean's Story",
    "summary": "Sean, diagnosed with vascular dementia at 55, shares how he continues to live well and find joy in everyday life.",
    "imageUrl": "",
    "link": "https://www.alzscot.org/seans-story"
  },
  {
    "title": "Caregiver Blog | The Caregiver's Voice",
    "summary": "A blog offering informative, inspirational, and humorous articles for caregivers of loved ones with dementia and Alzheimer's.",
    "imageUrl": "",
    "link": "https://thecaregiversvoice.com/blog/"
  },
  {
    "title": "Why I Advocate: A Young Caregiver's Story",
    "summary": "Vanessa Carter shares her journey as a young caregiver for her parents with Alzheimer's, highlighting the importance of advocacy.",
    "imageUrl": "",
    "link": "https://www.alzheimersblog.org/2022/03/18/why-i-advocate-a-young-caregivers-story/"
  },
  {
    "title": "5 Inspiring Stories of Meaningful Person-Centered Memory Care",
    "summary": "Stories demonstrating the benefits of personalized care approaches in memory care settings.",
    "imageUrl": "",
    "link": "https://blog.healthpropress.com/2024/05/5-inspiring-stories-of-meaningful-person-centered-memory-care/"
  },
  {
    "title": "Celebrating Dementia Caregivers: Wine, Women, & Dementia",
    "summary": "A documentary highlighting the experiences and resilience of dementia caregivers.",
    "imageUrl": "",
    "link": "https://dementiawho.com/celebrating-dementia-caregivers-wine-women-dementia/"
  },
  {
    "title": "Dementia Story: 7 Inspiring Lessons from My Heartfelt Story",
    "summary": "Cherie Voise shares her grandmother's dementia journey and the inspiration behind the Voise Foundation.",
    "imageUrl": "",
    "link": "https://www.voisefoundation.org/dementia-charity/dementia-story/"
  },
  {
    "title": "A Dedicated Caretaker Reflects on Her Husband's Alzheimer's",
    "summary": "A widow channels her grief into gratitude, creating a fundraising stamp to benefit Alzheimer's research.",
    "imageUrl": "",
    "link": "https://www.hopkinsmedicine.org/health/a-dedicated-caretaker-reflect-husbands-alzheimers-disease"
  },
  {
    "title": "Son Who Lived in Fear of Dad's Abuse Has Now Stepped Up to Be His Caregiver",
    "summary": "Andre Morrow becomes his father's caregiver, leading to healing and reconciliation in their relationship.",
    "imageUrl": "",
    "link": "https://people.com/veteran-with-ptsd-was-abusive-dad-now-son-is-his-caregiver-8749069"
  },
  {
    "title": "How I Found Meaning Outside of Caregiving My Loved One With Alzheimer's",
    "summary": "An individual shares insights on maintaining personal well-being while caregiving for a loved one with Alzheimer's.",
    "imageUrl": "",
    "link": "https://www.verywellmind.com/how-i-found-meaning-outside-of-caregiving-8789818"
  },
  {
    "title": "Me and My Mother: The Most Moving Dementia Story You'll Read",
    "summary": "Anthea Rowan provides a poignant account of caring for her mother with dementia, exploring the emotional complexities involved.",
    "imageUrl": "",
    "link": "https://www.thetimes.co.uk/article/anthea-rowan-silent-tsunami-dementia-depression-l82kmgvqp"
  },
  {
    "title": "I Left My Director Job at Meta After Becoming My Dad's Caregiver",
    "summary": "Shauna Sweeney shares her journey from a high-profile tech career to caregiving, and how she now supports others in similar roles.",
    "imageUrl": "",
    "link": "https://www.businessinsider.com/left-my-director-job-at-meta-take-care-dad-2025-4"
  },
  {
    "title": "Emma Heming Reflects on 'Monumental Highs and Devastating Lows' After Husband Bruce Willis' Dementia Diagnosis",
    "summary": "Emma Heming discusses the challenges and gratitude experienced following Bruce Willis' dementia diagnosis.",
    "imageUrl": "",
    "link": "https://pagesix.com/2025/03/22/celebrity-news/emma-heming-reflects-on-monumental-highs-and-devastating-lows-after-husband-bruce-willis-dementia-diagnosis/"
  },
  {
    "title": "Wendy Mitchell Obituary",
    "summary": "Remembering Wendy Mitchell, a writer and activist who lived positively with young-onset dementia and advocated for awareness.",
    "imageUrl": "",
    "link": "https://www.theguardian.com/society/2024/feb/26/wendy-mitchell-obituary"
  },
  {
    "title": "Graeme Sutherland: TikTok Journey",
    "summary": "Graeme Sutherland uses social media to raise awareness about Alzheimer's, sharing joyful and challenging moments.",
    "imageUrl": "",
    "link": "https://en.wikipedia.org/wiki/Graeme_Sutherland_%28internet_personality%29"
  },
  {
    "title": "Time Passages—The Henry Family and Elaine's Dementia",
    "summary": "A son's caregiver memoir inviting readers into the intimate details of his mother's life with dementia.",
    "imageUrl": "",
    "link": "https://thecaregiversvoice.com/blog/"
  },
  {
    "title": "Finding My Own Joy in Caregiving",
    "summary": "Julie Bennett shares an inspirational postscript to caregiving, finding joy amid grief after her husband's passing.",
    "imageUrl": "",
    "link": "https://thecaregiversvoice.com/blog/"
  }
]
